blog/2012/04/16/install-virtualbox-4.1.8-ose-on-slackware-13.37-x86_64/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Install virtualbox 4.1.8 OSE on Slackware 13.37 X86_64 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="virtualbox, slackware" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>Install virtualbox 4.1.8 OSE on Slackware 13.37 X86_64</h1>
  <p>
在Linux系统上编译安装软件总是记忆深刻的，因为这个过程往往是繁杂而痛苦的。我有两台电脑，一台式机一本本，台式机系统是Slackware 13.37 X86\_64 ,本本系统是Windows 7，因为工作原因要用到Baidu Hi，Outlook，Lync等Windows专有软件，所以一直在两台电脑之前切来切去，一直感觉很麻烦，一直想在台式机上装一个虚拟机运行Win 7。今天下午终于腾出时间在我的Slackware上装好virtualbox了。现在把过程记录下来，在Slackware下面装软件可以说是幸福的，因为它有像freebsd一样的包管理系统。
</p>

<ol class="org-ol">
<li>先到这里下载virtualbox <a href="http://slackbuilds.org/repository/13.37/system/virtualbox/"><a href="http://slackbuilds.org/repository/13.37/system/virtualbox/">http://slackbuilds.org/repository/13.37/system/virtualbox/</a></a> ，别急着动手且看下一步
</li>
<li>依赖iasl，所以先安装ACPICA <a href="http://slackbuilds.org/repository/13.37/system/virtualbox/"><a href="http://slackbuilds.org/repository/13.37/development/acpica/">http://slackbuilds.org/repository/13.37/development/acpica/</a></a> 
</li>
<li>virtualbox需要32位的库文件支持，而我装的是纯64位版的，所以需要安装32位的库文件：<a href="http://connie.slackware.com/~alien/multilib/13.37/"><a href="http://connie.slackware.com/~alien/multilib/13.37/">http://connie.slackware.com/~alien/multilib/13.37/</a></a>
</li>
</ol>
<p>
把相应的*.txz下载下来并用upgradepkg --install-new *.txz安装
</p>
<ol class="org-ol">
<li>依赖jdk，所以还要安装jdk，我装的是jdk-6u25
</li>
<li>最后安装virtualbox，成功后别急着运行
</li>
<li>virtualbox运行还依赖virtualbox-kernel <a href="http://slackbuilds.org/repository/13.37/system/virtualbox-kernel/"><a href="http://slackbuilds.org/repository/13.37/system/virtualbox-kernel/">http://slackbuilds.org/repository/13.37/system/virtualbox-kernel/</a></a> ,装完这个重启便可
</li>
</ol>

<p>
注意：slackbuilds.org站上找到包后，要下载Source Download列表中的每一个文件和Slack Build文件，否则会编译失败，编译成功后会生成/tmp/foo.tgz文件（slackware的包文件)，接着用installpkg foo.tgz便可成功安装。以上每步我都有生成包文件，如果环境与我一致，应该可以通用。
</p>

<p>
VirtualBox在安装了增强包之后就像打了鸡血一样，拖动窗口也不卡了，还可以和宿主机共享数据空间，还可以和宿主机共享粘贴板，并且分辩率随窗口大小而变化，真心感觉不错，赞一个！！！
</p>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
